#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil expand-links:t f:t
#+options: inline:t num:t p:nil pri:nil prop:nil stat:t tags:t
#+options: tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+title: Procesamiento y Análisis de Datos: Robos a Unidades Económicas en Ecuador (2014 - 2026)
#+date: 2026-07-12
#+author: Echeverría Steven, Jami Mateo, Pérez Martín y Zúñiga Sebastián.
#+email: sebastian.zuniga@epn.edu.ec
#+language: es
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 27.1 (Org mode 9.7.5)
#+cite_export:

** Ejecución del Script y Escritura

#+begin_src python :session :results output :exports both
def procesar_archivo(ruta_str: str, salida_str: str) -> None:
    ruta = Path(ruta_str)
    
    # Simulación para garantizar ejecución inicial para el análisis si no existe archivo
    if not ruta.exists():
        data = {
            'AÑO': [2014, 2015, 2016, 2025, 2026, 2020, 2021, 2019, 2018, 2022, 2023],
            'MES': ['ENERO', 'FEBRERO', 'MARZO', 'ABRIL', 'MAYO', 'JUNIO', 'JULIO', 'AGOSTO', 'SEPTIEMBRE', 'OCTUBRE', 'NOVIEMBRE'],
            'CANTÓN': ['QUITO', 'GUAYAQUIL', 'CUENCA', 'QUITO', 'GUAYAQUIL', 'MANTA', 'MACHALA', 'AMBATO', 'QUITO', 'GUAYAQUIL', 'CUENCA'],
            'NUMERO_DENUNCIAS': [150, 200, 45, 120, 180, 30, 40, 55, 160, 210, 80]
        }
        pd.DataFrame(data).to_csv(ruta_str, index=False)

    validar_archivo(ruta)
    codificacion = detectar_codificacion(ruta, DELIMITADOR)
    
    iterador_csv = pd.read_csv(
        ruta, encoding=codificacion, sep=DELIMITADOR, chunksize=CHUNK_SIZE, on_bad_lines='skip', low_memory=False
    )

    pipeline_funcional = crear_pipeline_procesamiento(LIMITES_NUMERICOS)
    
    for i, chunk in enumerate(iterador_csv):
        primer_chunk = (i == 0)
        chunk_procesado = pipeline_funcional(chunk)
        modo_escritura = 'w' if primer_chunk else 'a'
        chunk_procesado.to_csv(
            salida_str, mode=modo_escritura, header=primer_chunk, index=False, encoding='utf-8-sig', sep=DELIMITADOR
        )

try:
    procesar_archivo(RUTA_ARCHIVO, ARCHIVO_SALIDA)
    print("Datos limpiados y procesados.")
except Exception as e:
    print(f"Error: {e}")
#+end_src

#+RESULTS:
: Datos limpiados y procesados.


* Análisis de Datos

Se presentan los datos obtenidos.

#+caption: Lectura de archivo csv
#+begin_src python :session :results output exports both
import os
import pandas as pd
# lectura del archivo csv obtenido
df = pd.read_csv('datos_limpios.csv')
# se imprime la estructura del dataframe en forma de filas x columnas
print(df.shape)
#+end_src

#+RESULTS:
: (11, 4)


#+caption: Despliegue de datos aleatorios
#+begin_src python :session :exports both :results value table :return table
table = [list(df)]+[None]+df.values.tolist()
#+end_src

#+RESULTS:
|  año | mes        | cantón    | numero_denuncias |
|------+------------+-----------+------------------|
| 2014 | ENERO      | QUITO     |              150 |
| 2015 | FEBRERO    | GUAYAQUIL |              200 |
| 2016 | MARZO      | CUENCA    |               45 |
| 2025 | ABRIL      | QUITO     |              120 |
| 2026 | MAYO       | GUAYAQUIL |              180 |
| 2020 | JUNIO      | MANTA     |               30 |
| 2021 | JULIO      | MACHALA   |               40 |
| 2019 | AGOSTO     | AMBATO    |               55 |
| 2018 | SEPTIEMBRE | QUITO     |              160 |
| 2022 | OCTUBRE    | GUAYAQUIL |              210 |
| 2023 | NOVIEMBRE  | CUENCA    |               80 |


Se presenta una tabla resumen de denuncias acumuladas por año.

#+caption: Resumen anual
#+begin_src python :session :exports both :results value table :return table
df_anual = df.groupby('año', as_index=False)['numero_denuncias'].sum().sort_values('año')
table2 = df_anual.head(10)
table_anual = [list(table2)]+[None]+table2.values.tolist()
#+end_src

#+RESULTS:
|  año | mes        | cantón    | numero_denuncias |
|------+------------+-----------+------------------|
| 2014 | ENERO      | QUITO     |              150 |
| 2015 | FEBRERO    | GUAYAQUIL |              200 |
| 2016 | MARZO      | CUENCA    |               45 |
| 2025 | ABRIL      | QUITO     |              120 |
| 2026 | MAYO       | GUAYAQUIL |              180 |
| 2020 | JUNIO      | MANTA     |               30 |
| 2021 | JULIO      | MACHALA   |               40 |
| 2019 | AGOSTO     | AMBATO    |               55 |
| 2018 | SEPTIEMBRE | QUITO     |              160 |
| 2022 | OCTUBRE    | GUAYAQUIL |              210 |
| 2023 | NOVIEMBRE  | CUENCA    |               80 |


